In [14]:
import pandas as pd
from datetime import datetime
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

%matplotlib inline

In [6]:
df = pd.DataFrame({
    'a' : [1,34,54,67],
    'b' : ["20","41","51","90"],
    'c' : [156789424,156789429,15678942466,156779424]
})

In [7]:
df.shape

(4, 3)

In [10]:
#Для получения строки, где часть текста постоянна, можно использовать форматирование строк, например

template = 'df has {} rows and {} columns'
df_shape = template.format(df.shape[0], df.shape[1])

In [11]:
df_shape

'df has 4 rows and 3 columns'

In [12]:
df_shape = f'df has {df.shape[0]} rows and {df.shape[1]} columns'

In [13]:
df_shape

'df has 4 rows and 3 columns'

In [15]:
#работа с пропущенными значениями

df = pd.DataFrame({
    'a' : [1,34,None,67],
    'b' : [None,"41","51",None],
    'c' : [156789424,156789429,15678942466,156779424]
})

In [16]:
np.nan

nan

In [17]:
#работа с пропущенными значениями

df = pd.DataFrame({
    'a' : [1,34,np.nan,67],
    'b' : [np.nan,"41","51",np.nan],
    'c' : [156789424,156789429,15678942466,156779424]
})

In [18]:
df.isna()

       a      b      c
0  False   True  False
1  False  False  False
2   True  False  False
3  False   True  False

In [19]:
df.isna().sum()

a    1
b    2
c    0
dtype: int64

In [20]:
df.dtypes

a    float64
b     object
c      int64
dtype: object

In [23]:
df = pd.DataFrame({
    'a' : [1,34,np.nan,67],
    'b' : [np.nan,"41","51",np.nan],
    'age' : ['14','65','34','78']
})
df

      a    b age
0   1.0  NaN  14
1  34.0   41  65
2   NaN   51  34
3  67.0  NaN  78

In [26]:
df.dtypes

a      float64
b       object
age     object
dtype: object

In [44]:
new = df.astype({'age' : 'int' }) #важно поменять исходный датаврейм, inplace = True

In [45]:
new.dtypes

a      float64
b       object
age      int32
dtype: object

In [50]:
df['age'] = df['age'].astype('int') #важно поменять исходный датаврейм,

In [51]:
df.dtypes

a      float64
b       object
age      int32
dtype: object

In [69]:
data = {
    'client_id' : [1,34,54,67],
    'amount' : [20,41,51,90],
    'date' : [156789424,156789429,156782466,156779424]
}
df = pd.DataFrame(data)
df

   client_id  amount       date
0          1      20  156789424
1         34      41  156789429
2         54      51  156782466
3         67      90  156779424

In [56]:
#удаление не нужных колонок

df.drop(columns='date')

   client_id  amount
0          1      20
1         34      41
2         54      51
3         67      90

In [58]:
#удаление нескольких не нужных колонок - исходный датафрейм не изменился!!!

df.drop(columns=['date', 'amount'])

   client_id
0          1
1         34
2         54
3         67

In [68]:
df = df.drop(columns=['client_id'])

In [70]:
df.drop(columns=['date', 'amount'], inplace=True)